flatPlate/flatPlateExtended/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0) // 0
    (1 0 0) // 1
    (1 1 0) // 2
    (0 1 0) // 3
    (0 0 0.1) // 4
    (1 0 0.1) // 5
    (1 1 0.1) // 6
    (0 1 0.1) // 7

    (2 0 0) // 8
    (2 1 0) // 9
    (2 0 0.1) // 10
    (2 1 0.1) // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (0.2 5 1)
    hex (1 8 9 2 5 10 11 6) (20 20 1) simpleGrading (5 5 1)
);

edges
(
);

boundary
(
    zeroGradientPlanes
    {
        type patch;
        faces
        (
            (3 7 6 2)
	    (2 6 11 9)
	    (1 5 4 0)
	    (8 9 11 10)
        );
    }
    inlet
    {
	type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    plate
    {
	type wall;
	faces
        (
             (1 8 10 5)
         );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
	    (1 2 9 8)

            (4 5 6 7)
	    (5 10 11 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
